using UnityEngine;
using System;
using System.Security;
using System.Collections.Generic;
namespace Config
{
	public class parkingConfig
	{
		private parkingConfig(){ 
		}
		private static parkingConfig _inst;
		public static parkingConfig getInstace(){
			if (_inst != null) {
				return _inst;
			}
			_inst = new parkingConfig ();
			_inst.InitData ();
			return _inst;
		}
		public Dictionary<string,parkingCell> AllData;
		public parkingCell getCell(string key){
			parkingCell t = null;
			this.AllData.TryGetValue (key, out t);
			return t;
		}
		public parkingCell getCell(int key){
			parkingCell t = null;
			this.AllData.TryGetValue (key.ToString(), out t);
			return t;
		}
		public readonly int RowNum = 20;
		private void InitData(){
			this.AllData = new Dictionary<string,parkingCell> ();
			this.AllData.Add("1",new parkingCell("停车场",0,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3001,3003,3004,3006,3009,3011,3014,3016,3018,3023,3027,3032,3036,3040,3045,3049,3057,3066,3074,3083,3091},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("2",new parkingCell("停车场",1,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3018,3018,3019,3020,3023,3025,3027,3029,3031,3036,3040,3044,3049,3053,3057,3061,3070,3078,3087,3095,3103},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("3",new parkingCell("停车场",2,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3034,3034,3035,3036,3038,3040,3043,3045,3047,3051,3055,3060,3064,3068,3072,3076,3085,3093,3101,3110,3118},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("4",new parkingCell("停车场",3,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3049,3047,3047,3048,3050,3053,3055,3057,3059,3063,3067,3072,3076,3080,3084,3088,3097,3105,3113,3122,3130},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("5",new parkingCell("停车场",4,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3061,3059,3059,3060,3063,3065,3067,3069,3071,3075,3079,3084,3088,3092,3096,3100,3109,3117,3125,3133,3142},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("6",new parkingCell("停车场",5,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("7",new parkingCell("停车场",6,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("8",new parkingCell("停车场",7,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("9",new parkingCell("停车场",8,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("10",new parkingCell("停车场",9,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("11",new parkingCell("停车场",10,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("12",new parkingCell("停车场",11,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("13",new parkingCell("停车场",12,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("14",new parkingCell("停车场",13,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("15",new parkingCell("停车场",14,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("16",new parkingCell("停车场",15,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("17",new parkingCell("停车场",16,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("18",new parkingCell("停车场",17,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("19",new parkingCell("停车场",18,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
			this.AllData.Add("20",new parkingCell("停车场",19,0,4,5,1,163,"1",2,6,2,58,"100",4,"1",3,2000,new int[]{1,2,3,4,5,6,7,8},"parking_01",new string[]{"9001","9002","9003","9004","9005","9006","9007","9008"},new int[]{-1,1,1,-1,1,-1,1,-1},new int[]{0,10,25,50,100,150,200,250,300,400,500,600,700,800,900,1000,1200,1400,1600,1800,2000},new int[]{1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},new int[]{3002,3003,3004,3006,3009,3012,3014,3016,3018,3023,3027,3031,3036,3040,3044,3048,3057,3065,3073,3082,3090},new int[]{0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},20));
		}
	}
	public class parkingCell
	{
		///<summary>
		///停车场名称
		///<summary>
		public readonly string buildname;
		///<summary>
		///所属场景
		///<summary>
		public readonly int scene;
		///<summary>
		///停车费初始
		///<summary>
		public readonly int price;
		///<summary>
		///停车费公式
		///<summary>
		public readonly int priceformula;
		///<summary>
		///停车场来人速度初始
		///<summary>
		public readonly int touristbase;
		///<summary>
		///停车场来人速度公式
		///<summary>
		public readonly int touristformula;
		///<summary>
		///速度最大等级
		///<summary>
		public readonly int touristmaxlv;
		///<summary>
		///停车场来人速度升级消耗初始
		///<summary>
		public readonly string touristcastbase;
		///<summary>
		///停车场来人速度升级公式
		///<summary>
		public readonly int touristcastformula;
		///<summary>
		///停车场最大位置初始
		///<summary>
		public readonly int spacebase;
		///<summary>
		///停车场最大位置公式
		///<summary>
		public readonly int spaceformula;
		///<summary>
		///最大位置等级
		///<summary>
		public readonly int spacemaxlv;
		///<summary>
		///停车场最大位置升级消耗初始
		///<summary>
		public readonly string spaceupcastbase;
		///<summary>
		///停车场最大位置升级消耗公式
		///<summary>
		public readonly int spaceupcastformula;
		///<summary>
		///停车场利润升级初始消耗
		///<summary>
		public readonly string depletebase;
		///<summary>
		///停车场利润升级消耗公式
		///<summary>
		public readonly int depleteformula;
		///<summary>
		///等级上限
		///<summary>
		public readonly int lvmax;
		///<summary>
		///停车场开启等级
		///<summary>
		public readonly int[] openlv;
		///<summary>
		///停车场预制体名称
		///<summary>
		public readonly string prefabsname;
		///<summary>
		///开启组资源
		///<summary>
		public readonly string[] openggroup;
		///<summary>
		///停车位位置
		///<summary>
		public readonly int[] openseatdir;
		///<summary>
		///等级阶段
		///<summary>
		public readonly int[] lvshage;
		///<summary>
		///奖励类型
		///<summary>
		public readonly int[] lvrewardtype;
		///<summary>
		///奖励道具ID
		///<summary>
		public readonly int[] lvreward;
		///<summary>
		///奖励星星数量
		///<summary>
		public readonly int[] star;
		///<summary>
		///总星数
		///<summary>
		public readonly int starsum;
		public parkingCell(string buildname,int scene,int price,int priceformula,int touristbase,int touristformula,int touristmaxlv,string touristcastbase,int touristcastformula,int spacebase,int spaceformula,int spacemaxlv,string spaceupcastbase,int spaceupcastformula,string depletebase,int depleteformula,int lvmax,int[] openlv,string prefabsname,string[] openggroup,int[] openseatdir,int[] lvshage,int[] lvrewardtype,int[] lvreward,int[] star,int starsum){
			this.buildname = buildname;
			this.scene = scene;
			this.price = price;
			this.priceformula = priceformula;
			this.touristbase = touristbase;
			this.touristformula = touristformula;
			this.touristmaxlv = touristmaxlv;
			this.touristcastbase = touristcastbase;
			this.touristcastformula = touristcastformula;
			this.spacebase = spacebase;
			this.spaceformula = spaceformula;
			this.spacemaxlv = spacemaxlv;
			this.spaceupcastbase = spaceupcastbase;
			this.spaceupcastformula = spaceupcastformula;
			this.depletebase = depletebase;
			this.depleteformula = depleteformula;
			this.lvmax = lvmax;
			this.openlv = openlv;
			this.prefabsname = prefabsname;
			this.openggroup = openggroup;
			this.openseatdir = openseatdir;
			this.lvshage = lvshage;
			this.lvrewardtype = lvrewardtype;
			this.lvreward = lvreward;
			this.star = star;
			this.starsum = starsum;
		}
	}
}